fix: build and deploy testing
